public/upload/test_index.php.txt
This is ApacheBench, Version 2.3 <$Revision: 1826891 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Apache/2.4.34
Server Hostname:        localhost
Server Port:            80

Document Path:          /DistributedNetDisk/public/
Document Length:        109 bytes

Concurrency Level:      24
Time taken for tests:   44.532 seconds
Complete requests:      12000
Failed requests:        0
Total transferred:      3744000 bytes
HTML transferred:       1308000 bytes
Requests per second:    269.47 [#/sec] (mean)
Time per request:       89.065 [ms] (mean)
Time per request:       3.711 [ms] (mean, across all concurrent requests)
Transfer rate:          82.10 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       2
Processing:    19   89  23.8     87     366
Waiting:       18   89  23.7     87     366
Total:         19   89  23.8     87     366

Percentage of the requests served within a certain time (ms)
  50%     87
  66%     93
  75%     98
  80%    101
  90%    112
  95%    122
  98%    138
  99%    155
 100%    366 (longest request)